
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Тарифы
	Движения.Тарифы.Записывать = Истина;
	Движение = Движения.Тарифы.Добавить();
	Движение.Период = Дата;
	Движение.ТипТарифа = ТипТарифа;
	Движение.РесурсоснабжающаяОрганизация = РесурсоснабжающаяОрганизация;
	Движение.ЗначениеПервое = ЗначениеПервое;
	Движение.ЗначениеВторое = ЗначениеВторое;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
