
&НаКлиенте
Асинх Процедура ДобавитьПаспорт(Команда) 
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Результат = Ждать Проводник.ВыбратьАсинх();
    ФайлВХ = Ждать ПоместитьФайлНаСерверАсинх(,,,Проводник.ПолноеИмяФайла,УникальныйИдентификатор); 
	ПаспортАдрес = ФайлВХ.Адрес;
    Объект.ПаспортНаСчетчикФайл = Проводник.ПолноеИмяФайла;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(ПаспортСтрока) Тогда
	
		ПаспортНаСчетчик = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(ПаспортСтрока));
	    
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПаспортСтрока = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "ПаспортНаСчетчик");
	
	Если Объект.Ссылка.Пустая() Тогда
		  Элементы.ОткрытьПаспорт.Видимость = Ложь;
	  Иначе
		 Элементы.ДобавитьПаспорт.Видимость = Ложь; 
	КонецЕсли; 
	 
КонецПроцедуры


&НаКлиенте
Асинх Процедура ОткрытьПаспорт(Команда)
	
	Проводник = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Проводник.ПолноеИмяФайла =  Объект.ПаспортНаСчетчикФайл;
	Проводник.Расширение = Прав(Объект.ПаспортНаСчетчикФайл,3);
	Результат = Ждать Проводник.ВыбратьАсинх();
	ПолучитьФайлССервераАсинх(ПаспортСтрока, Проводник.ПолноеИмяФайла);
	ЗапуститьПриложениеАсинх(Проводник.ПолноеИмяФайла);

КонецПроцедуры

&НаСервереБезКонтекста
Функция УстановитьКодПрефикса()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Счетчики.Код) КАК Код
		|ИЗ
		|	Справочник.Счетчики КАК Счетчики";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Код = ВыборкаДетальныеЗаписи.Код + 1;

	КонецЦикла;
	
	Возврат Код;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Префикс = "" Тогда
	
	    Объект.Префикс = "Сч" + УстановитьКодПрефикса();
	КонецЕсли; 
	
КонецПроцедуры
