
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Движения.ПоказанияРегистр.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Счетчики.ТипСчетчика КАК ТипСчетчика
		|ИЗ
		|	Справочник.Счетчики КАК Счетчики
		|ГДЕ
		|	Счетчики.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Счетчик);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// регистр ПоказанияРегистр
		Движение = Движения.ПоказанияРегистр.Добавить();
		Движение.Период = Дата;
		Движение.Счетчик = Счетчик;
		Движение.ЗначениеПервое = ЗначениеПервое;
		
		
		Если ВыборкаДетальныеЗаписи.ТипСчетчика = Перечисления.ТипыСчетчиков.ДвухпозиционныйЭЭ Тогда
			Движение.ЗначениеВторое = ЗначениеВторое;
   		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 

	
	
КонецПроцедуры
