
&НаСервереБезКонтекста
Процедура ДобавитьКлиентаНаСервере(Клиент)
	
	Параметры = КлиентОбменДанными.ПолучитьПараметрыСоединенияСGo();
	Сообщить(КлиентRabbit.СоздатьОбменникRabbit(Параметры, Клиент));
	Сообщить(КлиентRabbit.ОбъявитьОчередьRabbit(Параметры, Клиент));
	Сообщить(КлиентRabbit.ПривязатьОчередьRabbit(Параметры, Клиент, Клиент, Клиент));
	
	НоваяЗапись = РегистрыСведений.ДобавленныеКлиенты.СоздатьМенеджерЗаписи(); 
	НоваяЗапись.Период = ТекущаяДата(); 
	НоваяЗапись.Клиент = Клиент;
	НоваяЗапись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьКлиента(Команда)
	ДобавитьКлиентаНаСервере(НазваниеКлиента);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьКлиентаНаСервере(Клиент)
	
	Параметры = КлиентОбменДанными.ПолучитьПараметрыСоединенияСGo();
	УдаленоУспешно = КлиентRabbit.УдалитьОчередьRabbit(Параметры, Клиент); 
	Сообщить(КлиентRabbit.УдалитьОбменникRabbit(Параметры, Клиент));
	
	Если УдаленоУспешно = "0" Тогда
	
		НаборЗаписей = РегистрыСведений.ДобавленныеКлиенты.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Клиент.Установить(Клиент);
		НаборЗаписей.Прочитать(); 
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
	
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура УдалитьКлиента(Команда)
	УдалитьКлиентаНаСервере(НазваниеКлиента);
КонецПроцедуры
