
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
		
	       
		 // регистр ПлатежиКвартира 
		Движения.ПлатежиКвартира.Записывать = Истина;
		Движение = Движения.ПлатежиКвартира.Добавить();
		Движение.ПериодОплаты = Строка(Месяц(Дата)) + "-"+Строка(Год(Дата)); 
		Движение.ТипТарифа  = ТипТарифа;
		Движение.Период = Дата;
		Движение.Квартира = Квартира;
		Движение.Сумма = Сумма;
		
		
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
